[
  {
    "Id": "536793",
    "ThreadId": "238635",
    "Html": "\r\n<p>Hi. First of all, I love this program. I downloaded it, followed the wizard, and had a TI-83&#43; emulator on my PC in no time. Thanks!</p>\r\n<p>My question: I'm using a tablet PC (Lenovo X201 Tablet). I can use wabbitemu with the trackpad, but it does not respond when I try to use it with the tablet's pen. I can't see any reason why it wouldn't, but I've also checked my configurations and can't\r\n find anything that looks like it would be a problem. Any ideas?</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks for the help.</p>\r\n",
    "PostedDate": "2010-12-16T07:29:28.957-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "537057",
    "ThreadId": "238635",
    "Html": "\r\n<p>Hey jecoady,</p>\r\n<p>I've heard reports of this issue on tablets before, and I'm not exactly sure what it is. I would assume that tablet input based on touch sends the same messages as a click with the mouse, but maybe not. Out of curiousity, are you running Windows XP? Also\r\n due to my lack of a tablet, would you be willing to test as I experiment with&nbsp;trying to get this to work?</p>\r\n<p>BuckeyeDude</p>\r\n",
    "PostedDate": "2010-12-16T16:30:39.987-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "537893",
    "ThreadId": "238635",
    "Html": "\r\n<p>Thanks for the quick response. I would be more than happy to test the program as you experiment with this. I'm running Windows 7. Let me know how I can help.</p>\r\n<p>-jecoady</p>\r\n",
    "PostedDate": "2010-12-19T03:43:11.723-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "545691",
    "ThreadId": "238635",
    "Html": "\r\n<p>Let me know if there is something I can do to help on this issue.</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-01-07T14:57:41.827-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "546894",
    "ThreadId": "238635",
    "Html": "\r\n<p>OK. I am not a Windows developer, but I know something about how X-windows works. I am trying to figure out what the difference between stylus input and mouse input could be.</p>\r\n<p>Documentation says:</p>\r\n<p>Stylus double tap (works to activate keys on calc): generates WM_LBUTTONDBLCLK</p>\r\n<p>Stylus single tap (does not work to activate keys): &quot;WM_LBUTTONDOWN and WM_LBUTTONUP sent when pen lifted.&quot;</p>\r\n<p>I don't believe it. Left click with the mouse highlights the key as long as you hold the botton down. Stylus never generates that highlighting - even when a double tap makes the number appear. I would like a way to ascertain what events are actually being\r\n generated by my stylus. Is there a program that will just list the events it receives to a log so I can find out if the stylus is really generating these clicks?</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-01-10T11:46:06.66-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "547043",
    "ThreadId": "238635",
    "Html": "\r\n<p>In theory there should be no difference between stylus and mouse input. Those messages are the exact same ones the mouse generates. Wabbitemu handles WM_LBUTTONDOWN and WM_LBUTTONUP. My only guess is that the stylus coordinates are off somehow, but I can't\r\n say without actually having a tablet...</p>\r\n<p>You can look at what messages its receiving using Spy&#43;&#43; (which you can find here: http://msdn.microsoft.com/en-us/library/ms734712.aspx). Open the processes window (Spy-&gt;processes) and find the wabbitemu process in the list. Right click messages. There\r\n will be many other messages firing (in particular WM_PAINT) but you can get rid of these by going to the logging options and making sure its just handling mouse and keyboard events. Then you should be able to click around and watch the lots of messages. Pick\r\n one key and click on it a bunch for me. Then save the log output and post it here. I'll take a look and see what happens</p>\r\n",
    "PostedDate": "2011-01-10T18:20:34.39-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "547694",
    "ThreadId": "238635",
    "Html": "\r\n<p>I posted two dumps (wabbit12.txt and wabbit13.txt) to the google site that I emailed you. The (possibly) relevant parts are:</p>\r\n<p>Single tap - wabbit12.txt - does not generate a &quot;1&quot; on the calculator:</p>\r\n<p>&lt;00111&gt; 00030610 P WM_LBUTTONDOWN fwKeys:MK_LBUTTON xPos:124 yPos:598<br>\r\n&lt;00112&gt; 00030610 S WM_ERASEBKGND hdc:0B010DC7<br>\r\n&lt;00113&gt; 00030610 R WM_ERASEBKGND fErased:False<br>\r\n&lt;00114&gt; 00030610 P WM_LBUTTONUP fwKeys:0000 xPos:124 yPos:598<br>\r\n&lt;00115&gt; 00030610 S WM_CAPTURECHANGED hwndNewCapture:00000000<br>\r\n&lt;00116&gt; 00030610 R WM_CAPTURECHANGED</p>\r\n<p>Double tap - wabbit13.txt - does generate a &quot;1&quot; on the calculator.</p>\r\n<p>&lt;00111&gt; 00030610 P WM_LBUTTONDOWN fwKeys:MK_LBUTTON xPos:125 yPos:591<br>\r\n&lt;00112&gt; 00030610 S WM_ERASEBKGND hdc:08010597<br>\r\n&lt;00113&gt; 00030610 R WM_ERASEBKGND fErased:False<br>\r\n&lt;00114&gt; 00030610 P WM_LBUTTONUP fwKeys:0000 xPos:125 yPos:591<br>\r\n&lt;00115&gt; 00030610 S WM_CAPTURECHANGED hwndNewCapture:00000000<br>\r\n&lt;00116&gt; 00030610 R WM_CAPTURECHANGED<br>\r\n&lt;00117&gt; 00030610 S WM_ERASEBKGND hdc:08010597<br>\r\n&lt;00118&gt; 00030610 R WM_ERASEBKGND fErased:False<br>\r\n&lt;00119&gt; 00030610 P WM_MOUSEMOVE fwKeys:0000 xPos:122 yPos:591<br>\r\n&lt;00120&gt; 00030610 P WM_MOUSEMOVE fwKeys:0000 xPos:122 yPos:590<br>\r\n&lt;00121&gt; 00030610 P WM_MOUSEMOVE fwKeys:0000 xPos:123 yPos:590<br>\r\n&lt;00122&gt; 00030610 P WM_MOUSEMOVE fwKeys:0000 xPos:124 yPos:590<br>\r\n&lt;00123&gt; 00030610 P WM_MOUSEMOVE fwKeys:0000 xPos:125 yPos:591<br>\r\n&lt;00124&gt; 00030610 P WM_LBUTTONDOWN fwKeys:MK_LBUTTON xPos:125 yPos:591<br>\r\n&lt;00125&gt; 00030610 S WM_ERASEBKGND hdc:08010597<br>\r\n&lt;00126&gt; 00030610 R WM_ERASEBKGND fErased:False<br>\r\n&lt;00127&gt; 00030610 P WM_MOUSEMOVE fwKeys:MK_LBUTTON xPos:126 yPos:590<br>\r\n&lt;00128&gt; 00030610 P WM_MOUSEMOVE fwKeys:MK_LBUTTON xPos:127 yPos:591<br>\r\n&lt;00129&gt; 00030610 P WM_LBUTTONUP fwKeys:0000 xPos:127 yPos:591<br>\r\n&lt;00130&gt; 00030610 S WM_CAPTURECHANGED hwndNewCapture:00000000<br>\r\n&lt;00131&gt; 00030610 R WM_CAPTURECHANGED</p>\r\n<p>Let me know if any of this looks helpful... I can't see the difference!</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-01-11T18:15:10.21-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "547852",
    "ThreadId": "238635",
    "Html": "\r\n<p>Two important questions, what skin were you using? Also are you in cutout or normal windowed mode?</p>\r\n",
    "PostedDate": "2011-01-12T01:23:37.487-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "547988",
    "ThreadId": "238635",
    "Html": "\r\n<p>I'm using the default skin and in normal windowed mode. The Wammitemu Options -&gt; Skin page shows only &quot;Use Screen Texture&quot; is checked. There is no custom skin, no cutout skin.</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-01-12T05:44:36.003-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "547990",
    "ThreadId": "238635",
    "Html": "\r\n<p>Default skin being the 83 Plus?</p>\r\n",
    "PostedDate": "2011-01-12T05:47:43.103-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "548093",
    "ThreadId": "238635",
    "Html": "\r\n<p>Yes. I'm using the TI-83 Plus skin with a rom that advertises itself as version 1.12.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-01-12T08:59:58.137-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "677931",
    "ThreadId": "238635",
    "Html": "<p>Would LOVE to know how to fix this problem too. Any solutions so far! The best I've been able to do is use the stylus to direct where the cursor and then left click on my laptop mouse pad. Kind of a pain. Thing is, it used to work just by clicking with the pen.</p>",
    "PostedDate": "2011-09-28T16:32:01.367-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "677971",
    "ThreadId": "238635",
    "Html": "<p>No news recently. Same thing happens with the most recent build of Wabbitemu on a Windows 7 box (Toshiba).</p>\r\n<p>I couldn't figure out how to build Wabbitemu from source, not being any kind of Windows developer. If you can help do that, I would look at it more.</p>",
    "PostedDate": "2011-09-28T19:58:52.883-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "679891",
    "ThreadId": "238635",
    "Html": "<p>You guys are both using the cutout skin correct? Have you tried doing this on the non cutout? I'd be curious to see if it has the same problem there</p>",
    "PostedDate": "2011-10-04T09:50:44.6-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "679982",
    "ThreadId": "238635",
    "Html": "\r\n<div dir=\"ltr\">It has the same problem with either skin for me.<br>\r\n<br>\r\n-Marissa<br>\r\n<br>\r\n<div>\r\n<hr id=\"stopSpelling\">\r\nFrom: [email removed]<br>\r\nTo: [email removed]<br>\r\nDate: Tue, 4 Oct 2011 09:50:48 -0700<br>\r\nSubject: Re: Wabbitemu on a Tablet PC? [wabbit:238635]<br>\r\n<br>\r\nFrom: BuckeyeDude<br>\r\n<div id=\"ecxThreadNotificationPostBody\">You guys are both using the cutout skin correct? Have you tried doing this on the non cutout? I'd be curious to see if it has the same problem there<br>\r\n</div>\r\n<div id=\"ecxThreadNotificationFooter\">Read the <a href=\"http://wabbit.codeplex.com/discussions/238635#post679891\" target=\"_blank\">\r\nfull discussion online</a>.<br>\r\nTo add a post to this discussion, reply to this email (<a href=\"mailto:wabbit@discussions.codeplex.com?subject=[wabbit:238635]\">wabbit@discussions.codeplex.com</a>)<br>\r\nTo start a new discussion for this project, email <a href=\"mailto:wabbit@discussions.codeplex.com\">\r\nwabbit@discussions.codeplex.com</a><br>\r\nYou are receiving this email because you subscribed to this discussion on CodePlex. You can\r\n<a href=\"https://wabbit.codeplex.com/discussions/238635/unsubscribe/\" target=\"_blank\">\r\nunsubscribe</a> on CodePlex.com.<br>\r\nPlease note: Images and attachments will be removed from emails. Any posts to this discussion will also be available online at CodePlex.com<br>\r\n</div>\r\n</div>\r\n</div>\r\n",
    "PostedDate": "2011-10-04T13:22:58.72-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "680365",
    "ThreadId": "238635",
    "Html": "<p>Hmm thats unfortunate. I've got a wabbitemu that I'd like you guys to test with your tablet. I'm working to acquire one but so far no luck. You can download this version on the downloads page, its the one titled Wabbitemu Debug. This version will have a console window that pops up. It will log messages (mostly related to the keys). Go ahead and try to click on a key with your stylus and paste me the output (you can copy by right clicking on the title&nbsp;bar&nbsp;and selecting mark, then dragging and right clicking copy. Control+C will not work). Also please tell me which key you clicked on. If all works you should see something like this:</p>\r\n<p>WM_LBUTTONDOWN x: 122, y: 550,<br />Color value: 1040002<br />WM_LBUTTONUP</p>",
    "PostedDate": "2011-10-05T10:31:27.16-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "681036",
    "ThreadId": "238635",
    "Html": "<p>Wabbitemu Debug: doesn't function correctly. The log window is active, but the main calculator window can't be dragged(?!) and won't turn on with F12 (can't reach the \"on\" button), although if I click on a key it lights up but no log messages appear. Built correctly? Running Windows 7 on a tablet.</p>",
    "PostedDate": "2011-10-06T14:32:20.513-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "681054",
    "ThreadId": "238635",
    "Html": "<p>Yes this is the expected behavior, sorry forgot to warn you. The not being able to drag comes from I want to handle any clicks that are not on the buttons, which we treat the same as the title bar so you can drag. You should see the WM_NCBUTTONDOWN message in the log if you try to drag. The calculator doesnt have to be on for it to register key presses. By lights up you mean youre in windowed mode and that the key is shaded to indicate you pressed it? If you have no log messages, I'm slightly concerned, there should be a&nbsp;least <em>something&nbsp;</em>showing up. To ensure the log is working&nbsp;correctly press F11&nbsp;to open the debugger and you should see a \"Got a command\"&nbsp;message. I have no issues with it on either of my machines, both on Windows 7</p>",
    "PostedDate": "2011-10-06T14:56:48.703-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "681069",
    "ThreadId": "238635",
    "Html": "<p>Definitely not working. I did F11 to open. No messages in console. Debugger does not produce any messages in the console. Not sure if this is expected, but in the debugger \"step\" doesn't go anywhere. It just sits on 00 0983 \"push af\" and doesn't move? Calculator isn't on, so maybe this is not a concern.&nbsp;</p>",
    "PostedDate": "2011-10-06T15:47:50.263-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "681104",
    "ThreadId": "238635",
    "Html": "<p>Hmm this is indeed odd. I think I'll just have to get my hands on a tablet and test this all myself. The debugger not stepping doesn't sound correct at the address you've specified. Was the line highlighted gold or gray?</p>",
    "PostedDate": "2011-10-06T18:21:42.703-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "681113",
    "ThreadId": "238635",
    "Html": "<p>OK. I went to look at it again, and got it going (but not producing any debug output). What I found was that now even with the mouse, I need to double click quickly in succession in order for the clicks to register with ANYTHING, including the menu options. Doing that, I was able to use the menu to turn on the calculator and manipulate the buttons. I went back to the other (up to date) Wabbitemu just to make sure I wasn't imagining that this was a change, and I wasn't. The regular Wabbitemu responds just find to single mouse clicks - no double clicking at all needed. Can you think of anything to do/try with this information?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2011-10-06T19:22:57.54-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "681115",
    "ThreadId": "238635",
    "Html": "<p>No its useless without the debug output. Thats the reason that clicking nonclient areas (such as the menus or titlebar don't work). For some reason the output is not getting attached properly</p>",
    "PostedDate": "2011-10-06T19:27:41.973-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "681124",
    "ThreadId": "238635",
    "Html": "<p>Can you just hard-code the output to go some file in c:\\WINDOWS\\TEMP or something like that?</p>",
    "PostedDate": "2011-10-06T20:37:41.75-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "696011",
    "ThreadId": "238635",
    "Html": "<p>i also have a tablet let me know if i can be of assistance. i got the debug version is there specific things you want me to try out ?<br /><br />this is what i did i clicked once on power with mouse on laptop then i clicked once with mouse on laptop on 1 then i did one single tap one wasnt registered i did 2 quick double tap the one appeared.<br /><br />here is the info with the picture <br /><br />[URL=http://imageshack.us/photo/my-images/522/debugx.png/][IMG]http://img522.imageshack.us/img522/495/debugx.png[/IMG][/URL]<br /><br />Uploaded with [URL=http://imageshack.us]ImageShack.us[/URL]</p>",
    "PostedDate": "2011-11-09T10:18:15.853-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "696038",
    "ThreadId": "238635",
    "Html": "<p>Alright this is good that shows that it is indeed receiving the keypress and its valid. So now I think the reason that this doesn't work is because of timing issues with the emulator. Because we're emulating at most a 15 MHz device, theres a lot of time leftover for whatever, that we have to waste to make it look like the calculator is running at the correct speed. I think that the single tap might be too fast, meaning that the emulator sends the keypress and the keyrelease code before the emulator has a chance to respond to the input. Thus when you double click it doubles the time it appears to be pressed down and the OS has more time to react. The way to test this will be to set the speed of the calculator higher. Goto Calculator-&gt;Speed-&gt;400%. Then try single tapping. If that doesn't work, do a custom speed and try 800 or 1600. You dont need to use the debug version, you can do it with any old version.</p>",
    "PostedDate": "2011-11-09T11:08:36.513-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "696063",
    "ThreadId": "238635",
    "Html": "<p>That's not it for me. I still need to double-tap when speed is set to maximum.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2011-11-09T11:36:10.627-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "696072",
    "ThreadId": "238635",
    "Html": "<p>I have a feeling this still may be an issue. Let me write some code to detect this and a couple other ideas I have</p>",
    "PostedDate": "2011-11-09T11:59:07.757-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "696159",
    "ThreadId": "238635",
    "Html": "<blockquote style=\"border: solid .1em #ccc; font-style: italic; margin: .25em 1em 0 1em; padding: 0 .25em 0 .25em;\"><strong>BuckeyeDude wrote:</strong><br />\r\n<p>I have a feeling this still may be an issue. Let me write some code to detect this and a couple other ideas I have</p>\r\n</blockquote>\r\n<p>that wasn't it for me either.<br /><br />i did the max speed at 400% first then increased to max speed.<br />turned off calculator input the speed before turning it on still same results even with max speed maxed out</p>",
    "PostedDate": "2011-11-09T14:35:27.887-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "710257",
    "ThreadId": "238635",
    "Html": "<p>This is my first post, so I do have to commend you on this wonderful software... It's been an amazing tool in my classroom!</p>\r\n<p>I'm also having the same issues when using the new wabbitemu on the tablet.&nbsp; However, when I turn on the keypress history, the keys are being \"pressed\" and logged but it's not registering as a press on the actual calculator.</p>\r\n<p>Also, when I use the mouse or keyboard to control the calculator, it only registers if I press the mouse or keyboard with some force.&nbsp; If I press the mouse or key board lightly, it will again show up on the keylog but not on the calculator.</p>",
    "PostedDate": "2011-12-10T06:49:09.73-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "710436",
    "ThreadId": "238635",
    "Html": "<p>This is actually awesome news. It confirms what I was thinking before, which is that Wabbitemu does indeed process the key, but the emulator core doesn't react fast enough. The solution could be simple, but I don't actually know since I've never had this issue occur outside a tablet. I'll post a new version very soon, I've had one in the works for a while now but I haven't had enough time to test it and make sure it doesn't cause any new issues.</p>",
    "PostedDate": "2011-12-10T23:11:06.48-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "711341",
    "ThreadId": "238635",
    "Html": "<p>The newest version is out, go ahead and download see if it fixes this issue. I *think* it should, it now allows for zero delay between mouse events. If it doesn't we'll have to do a little more probing</p>",
    "PostedDate": "2011-12-13T03:00:16.383-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "711404",
    "ThreadId": "238635",
    "Html": "<p>Update works great on the tablet (keyboard and with the tablet input)!</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks!</p>",
    "PostedDate": "2011-12-13T05:22:22.497-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "712869",
    "ThreadId": "238635",
    "Html": "<p>I can confirm that the latest release (Dec 15 2011) fixes the issues I had with the pen input on a tablet as well. Thanks!</p>",
    "PostedDate": "2011-12-15T11:45:33.07-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "718745",
    "ThreadId": "238635",
    "Html": "<p>beautiful man. works perfect =D<br /><br /></p>",
    "PostedDate": "2011-12-30T08:44:38.32-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]